package hw4_cycles;

public class Main2 {
    public static void main(String[] args) {

        //Задача 2
        //*С помощью цикла for выведите в консоль все числа от 10 до 1.*//
        for (int i = 10; i > 0; i--) {
            System.out.println("Итерация цикла " + i);
        }
    }
}
