package hw4_cycles;
// ЦИКЛЫ
public class Main1 {
    public static void main(String[] args) {
        //Задача 1
        // *С помощью цикла for выведите в консоль все числа от 1 до 10.*//
        for(int i = 1; i <= 10; i = i + 1){
            System.out.println("Итерация цикла " + i);
        }
    }
}


