package hw8_arrays_lesson1;

import java.util.Arrays;

public class Task1 {
    public static void main(String[] args) {
        //Задача 1
        //*Объявите три массива:
        //
        //1) Целочисленный массив, заполненный тремя цифрами — 1, 2 и 3 — с помощью ключевого слова new
        //2) Массив, в котором можно хранить три дробных числа — 1.57, 7.654, 9.986. Массив сразу заполните значениями.
        //3) Произвольный массив. Тип и количество данных определите сами. Самостоятельно выберите способ создания массива:
        // с помощью ключевого слова или сразу заполненный элементами.*//

    }
}